In [1]:
import matplotlib.pyplot as plt
import pandas as pd

DUMMY VARIABLES == CATEGORICAL DATA == ONE HOT ENCODING

For model in ML we need to convert categorical data to numerical data with get_dummies. Get_dummies is a function in pandas that converts categorical data into numerical data. It creates a new column for each category and assigns a 1 or 0 to the column. 1 if the category is present and 0 if the category is not present.

In [2]:
titanic = pd.read_csv('../../Data/titanic.csv')
titanic.drop(labels='age', axis=1, inplace=True)
titanic.head()

   survived  pclass     sex  sibsp  parch     fare embarked deck
0         0       3    male      1      0   7.2500        S  NaN
1         1       1  female      1      0  71.2833        C    C
2         1       3  female      0      0   7.9250        S  NaN
3         1       1  female      1      0  53.1000        S    C
4         0       3    male      0      0   8.0500        S  NaN

In [7]:
pd.get_dummies(titanic, columns=['sex', 'pclass'])

,survived,sibsp,parch,fare,embarked,deck,sex_female,sex_male,pclass_1,pclass_2,pclass_3
0,0,1,0,7.2500,S,NaN,False,True,False,False,True
1,1,1,0,71.2833,C,C,True,False,True,False,False
2,1,0,0,7.9250,S,NaN,True,False,False,False,True
3,1,1,0,53.1000,S,C,True,False,True,False,False
4,0,0,0,8.0500,S,NaN,False,True,False,False,True
...,...,...,...,...,...,...,...,...,...,...,...
886,0,0,0,13.0000,S,NaN,False,True,False,True,False
887,1,0,0,30.0000,S,B,True,False,True,False,False
888,0,1,2,23.4500,S,NaN,True,False,False,False,True
889,1,0,0,30.0000,C,C,False,True,True,False,False
890,0,0,0,7.7500,Q,NaN,False,True,False,False,True